docs/Rethinking-impact-research.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-27 Sat 21:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Improve the Impact of My Research</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">How to Improve the Impact of My Research</h1>
<p>
Recently I am thinking about a critic question of "how to improve the impact of my publicated papers". This concern raised because the following observations:
</p>
<ul class="org-ul">
<li>The Paper-Researcher relationship changes. In past, it is many researchers talking about a few publicated studies. but currently, there emerged more and more "top-tier" papers, where even a person under a narrow research domain cannot read out the publicated studies in his/her field easily. Therefore, publication is not the endpoint of "acceptance", "MAKE OTHER PEOPLE KNOW MY WORK" is the endpoint of such an "acceptance".</li>
<li>The paper becomes a thing "almost everyone owns". In the past ages, people with three studies can be seen as a mature researcher in corresponding field. However, currently, many people own a lot of paper, and even get acceptance of a lot of their works every year. Under such a situation, I suffer from the choice: either obtain many publications, or have some famous publications, or the both.</li>
</ul>

<p>
Specifically, under such a "red sea" situation, I must consider: does there exist any other subjective and objective metric that distinguish a researcher with others?
</p>

<p>
I think the answer is yes. Citations, can be seen as a simple but effective metric for that. Besides, let all people in this field know me, is also an important solution.
</p>

<p>
Therefore, I propose a new plan to improve the impact of my research, named "Plan Poisoning". I will regard my publications and my precious works as the poisoning data, and aim to inject them into the Internet by myself.
</p>

<p>
The detailed plan is as follows:
</p>

<ol class="org-ol">
<li>Join academic conference more frequently. This provides me the opportunity to connect with other person in this field. To do that, I need to submit my paper with a certain frequency.</li>
<li>Once a study is accomplished, I need to announce and introduce it under the following platforms:
<ol class="org-ol">
<li>Wechat</li>
<li>X</li>
<li>Discord</li>
<li>Zhihu</li>
<li>RedNote</li>
<li>Blog in this website</li>
<li>I require myself to write email to share my study with other people</li>
<li>Write Chinese article to some Wechat platforms</li>
<li>Make video and submit it into Youtube and Bilibili</li>
</ol></li>
<li>Seeking for collaborators to improve the publications of non-first-author publications.</li>
</ol>

<p>
Let me see the effectiveness of this strategy on <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-01 Mon&gt;</span></span>.
</p>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Mon Apr  7 16:40:00 2025</span> <span class="date">Last modified: 2025-09-27 Sat 19:50</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
